loadtest/configs/comment.yml
#----------------------------------------------------------------------
# Comment Creation Load Test Configuration
#----------------------------------------------------------------------
config:
  target: 'http://localhost:3000/api/v1'

  phases:
    - name: 'Warmup Phase'
      duration: 60
      arrivalRate: 1
      rampTo: 8
      comment: 'Gradually increase load to warm up the system'

    # - name: 'Sustained Load Phase'
    #   duration: 180
    #   arrivalRate: 8
    #   comment: 'Maintain steady load to evaluate stability'

    # - name: 'Peak Load Phase'
    #   duration: 120
    #   arrivalRate: 10
    #   rampTo: 23
    #   comment: 'Ramp up to peak load to identify breaking points'

  processor: '../scripts/helpers.js'

  plugins:
    expect: {}

  thresholds:
    http.response_time.median: 300
    http.response_time.p95: 800
    http.response_time.p99: 1500
    http.errors: 1
    http.request_rate: 5

  http:
    timeout: 20000

before:
  flow:
    - function: 'preFetchAllDiscussions'
    - think: 1

#----------------------------------------------------------------------
# Test Scenarios
#----------------------------------------------------------------------
scenarios:
  - name: 'Add comments to discussions'
    weight: 80
    flow:
      # Load pre-fetched discussion IDs
      - function: 'loadDiscussionIds'
      - function: 'checkDiscussionId'

      - loop:
          # Generate random comment data
          - function: 'generateCommentData'

          # Capture timestamp for e2e latency
          - function: 'captureTimestamp'

          # Join discussion room via WebSocket to receive updates
          - function: 'joinDiscussionRoom'

          # Post comment to the discussion
          - post:
              url: '/discussions/{{ discussionId }}/comments'
              beforeRequest: 'setAuthHeader'
              json:
                content: '{{ commentContent }}'
                parentId: '{{ parentId }}'
                clientRequestTime: '{{ timestamp }}'
              capture:
                - json: '$.data.id'
                  as: 'commentId'
              expect:
                - statusCode: 201

          # Wait briefly to ensure notification is processed
          - think: 1
        count: 3

  - name: 'Add comments with file attachments'
    weight: 20
    flow:
      # Load pre-fetched discussion IDs
      - function: 'loadDiscussionIds'

      # Make sure we have a valid discussion ID
      - function: 'checkDiscussionId'

      - loop:
          # Generate random comment data
          - function: 'generateCommentData'

          # Generate random file attachments (limited to 2)
          - function: 'generateCommentAttachments'

          # Create comment with attachments via custom function
          - function: 'createCommentWithAttachments'

          # Wait briefly to ensure notification is processed
          - think: 1
        count: 2